### Deployment Results :white_check_mark:

 **GrantBirki** successfully **noop** deployed branch `GrantBirki-patch-1` to **production**





<details><summary>Show Results</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # cloudflare_record.cache has changed
  ~ resource "cloudflare_record" "cache" {
        id              = "03fe31c72264d5c29ed63ab520988055"
      ~ modified_on     = "2023-01-03T03:52:24.455009Z" -> "2024-03-10T23:24:25.455763Z"
        name            = "cache"
        # (10 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.cache will be updated in-place
  ~ resource "cloudflare_record" "cache" {
        id              = "03fe31c72264d5c29ed63ab520988055"
        name            = "cache"
      ~ value           = "20.124.115.39" -> "20.49.104.36"
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.cache_azure_function_verification will be created
  + resource "cloudflare_record" "cache_azure_function_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "asuid.cache"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "966A35FCB4A0FE1176E2320038F9EA960F6E2FE36A69ABDFC79A272FE4E2228F"
      + zone_id         = "a17204c79af55fcf05e4975f66e2490e"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>
